Tekla.Structures.Drawing.ElementBase
The ElementBase class is the abstract base class for all mark elements.

Tekla.Structures.Drawing.ElementBase.Hidden
Sets if the content is hidden from view.

Tekla.Structures.Drawing.ElementBase.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2

Tekla.Structures.Drawing.ElementBase.IsEqual(System.Object)
Compares the current object with the given object.
Checks every field of both objects for equality.
ObjectToCompare: An object of the same type to be used for comparing.
Returns: True if the field values of both objects match.

Tekla.Structures.Drawing.ElementBase.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.